node {
  name: "weights_and_biases/random_normal/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "3\000\000\000\031\000\000\000"
      }
    }
  }
}
node {
  name: "weights_and_biases/random_normal/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "weights_and_biases/random_normal/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "weights_and_biases/random_normal/RandomStandardNormal"
  op: "RandomStandardNormal"
  input: "weights_and_biases/random_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "weights_and_biases/random_normal/mul"
  op: "Mul"
  input: "weights_and_biases/random_normal/RandomStandardNormal"
  input: "weights_and_biases/random_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "weights_and_biases/random_normal"
  op: "Add"
  input: "weights_and_biases/random_normal/mul"
  input: "weights_and_biases/random_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "weights_and_biases/forget_and_input_weight"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 51
        }
        dim {
          size: 25
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "weights_and_biases/forget_and_input_weight/Assign"
  op: "Assign"
  input: "weights_and_biases/forget_and_input_weight"
  input: "weights_and_biases/random_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@weights_and_biases/forget_and_input_weight"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "weights_and_biases/forget_and_input_weight/read"
  op: "Identity"
  input: "weights_and_biases/forget_and_input_weight"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@weights_and_biases/forget_and_input_weight"
      }
    }
  }
}
node {
  name: "weights_and_biases/random_normal_1/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "3\000\000\000\031\000\000\000"
      }
    }
  }
}
node {
  name: "weights_and_biases/random_normal_1/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "weights_and_biases/random_normal_1/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "weights_and_biases/random_normal_1/RandomStandardNormal"
  op: "RandomStandardNormal"
  input: "weights_and_biases/random_normal_1/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "weights_and_biases/random_normal_1/mul"
  op: "Mul"
  input: "weights_and_biases/random_normal_1/RandomStandardNormal"
  input: "weights_and_biases/random_normal_1/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "weights_and_biases/random_normal_1"
  op: "Add"
  input: "weights_and_biases/random_normal_1/mul"
  input: "weights_and_biases/random_normal_1/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "weights_and_biases/output_weight"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 51
        }
        dim {
          size: 25
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "weights_and_biases/output_weight/Assign"
  op: "Assign"
  input: "weights_and_biases/output_weight"
  input: "weights_and_biases/random_normal_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@weights_and_biases/output_weight"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "weights_and_biases/output_weight/read"
  op: "Identity"
  input: "weights_and_biases/output_weight"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@weights_and_biases/output_weight"
      }
    }
  }
}
node {
  name: "weights_and_biases/random_normal_2/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "3\000\000\000\031\000\000\000"
      }
    }
  }
}
node {
  name: "weights_and_biases/random_normal_2/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "weights_and_biases/random_normal_2/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "weights_and_biases/random_normal_2/RandomStandardNormal"
  op: "RandomStandardNormal"
  input: "weights_and_biases/random_normal_2/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "weights_and_biases/random_normal_2/mul"
  op: "Mul"
  input: "weights_and_biases/random_normal_2/RandomStandardNormal"
  input: "weights_and_biases/random_normal_2/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "weights_and_biases/random_normal_2"
  op: "Add"
  input: "weights_and_biases/random_normal_2/mul"
  input: "weights_and_biases/random_normal_2/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "weights_and_biases/gate_weight"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 51
        }
        dim {
          size: 25
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "weights_and_biases/gate_weight/Assign"
  op: "Assign"
  input: "weights_and_biases/gate_weight"
  input: "weights_and_biases/random_normal_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@weights_and_biases/gate_weight"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "weights_and_biases/gate_weight/read"
  op: "Identity"
  input: "weights_and_biases/gate_weight"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@weights_and_biases/gate_weight"
      }
    }
  }
}
node {
  name: "weights_and_biases/random_normal_3/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\031\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "weights_and_biases/random_normal_3/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "weights_and_biases/random_normal_3/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "weights_and_biases/random_normal_3/RandomStandardNormal"
  op: "RandomStandardNormal"
  input: "weights_and_biases/random_normal_3/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "weights_and_biases/random_normal_3/mul"
  op: "Mul"
  input: "weights_and_biases/random_normal_3/RandomStandardNormal"
  input: "weights_and_biases/random_normal_3/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "weights_and_biases/random_normal_3"
  op: "Add"
  input: "weights_and_biases/random_normal_3/mul"
  input: "weights_and_biases/random_normal_3/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "weights_and_biases/outwards_propagating_weight"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 25
        }
        dim {
          size: 1
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "weights_and_biases/outwards_propagating_weight/Assign"
  op: "Assign"
  input: "weights_and_biases/outwards_propagating_weight"
  input: "weights_and_biases/random_normal_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@weights_and_biases/outwards_propagating_weight"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "weights_and_biases/outwards_propagating_weight/read"
  op: "Identity"
  input: "weights_and_biases/outwards_propagating_weight"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@weights_and_biases/outwards_propagating_weight"
      }
    }
  }
}
node {
  name: "weights_and_biases/zeros"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 1
          }
          dim {
            size: 25
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "weights_and_biases/forget_and_input_bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 25
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "weights_and_biases/forget_and_input_bias/Assign"
  op: "Assign"
  input: "weights_and_biases/forget_and_input_bias"
  input: "weights_and_biases/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@weights_and_biases/forget_and_input_bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "weights_and_biases/forget_and_input_bias/read"
  op: "Identity"
  input: "weights_and_biases/forget_and_input_bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@weights_and_biases/forget_and_input_bias"
      }
    }
  }
}
node {
  name: "weights_and_biases/zeros_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 1
          }
          dim {
            size: 25
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "weights_and_biases/output_bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 25
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "weights_and_biases/output_bias/Assign"
  op: "Assign"
  input: "weights_and_biases/output_bias"
  input: "weights_and_biases/zeros_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@weights_and_biases/output_bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "weights_and_biases/output_bias/read"
  op: "Identity"
  input: "weights_and_biases/output_bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@weights_and_biases/output_bias"
      }
    }
  }
}
node {
  name: "weights_and_biases/zeros_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 1
          }
          dim {
            size: 25
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "weights_and_biases/gate_bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 25
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "weights_and_biases/gate_bias/Assign"
  op: "Assign"
  input: "weights_and_biases/gate_bias"
  input: "weights_and_biases/zeros_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@weights_and_biases/gate_bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "weights_and_biases/gate_bias/read"
  op: "Identity"
  input: "weights_and_biases/gate_bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@weights_and_biases/gate_bias"
      }
    }
  }
}
node {
  name: "weights_and_biases/zeros_3"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 1
          }
          dim {
            size: 1
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "weights_and_biases/outwards_propagating_bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 1
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "weights_and_biases/outwards_propagating_bias/Assign"
  op: "Assign"
  input: "weights_and_biases/outwards_propagating_bias"
  input: "weights_and_biases/zeros_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@weights_and_biases/outwards_propagating_bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "weights_and_biases/outwards_propagating_bias/read"
  op: "Identity"
  input: "weights_and_biases/outwards_propagating_bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@weights_and_biases/outwards_propagating_bias"
      }
    }
  }
}
node {
  name: "placeholders/input_placeholder"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 1
        }
      }
    }
  }
}
node {
  name: "placeholders/label"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 1
        }
      }
    }
  }
}
node {
  name: "placeholders/last_hidden"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 25
        }
      }
    }
  }
}
node {
  name: "placeholders/last_cell"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 25
        }
      }
    }
  }
}
node {
  name: "to_gates/input_concat/axis"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "to_gates/input_concat"
  op: "ConcatV2"
  input: "placeholders/input_placeholder"
  input: "placeholders/last_hidden"
  input: "placeholders/last_cell"
  input: "to_gates/input_concat/axis"
  attr {
    key: "N"
    value {
      i: 3
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "to_gates/f_w_m"
  op: "MatMul"
  input: "to_gates/input_concat"
  input: "weights_and_biases/forget_and_input_weight/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "to_gates/f_b_a"
  op: "Add"
  input: "to_gates/f_w_m"
  input: "weights_and_biases/forget_and_input_bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "to_gates/g_w_m"
  op: "MatMul"
  input: "to_gates/input_concat"
  input: "weights_and_biases/gate_weight/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "to_gates/g_b_a"
  op: "Add"
  input: "to_gates/g_w_m"
  input: "weights_and_biases/gate_bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "non-linearity/sigmoid_forget"
  op: "Sigmoid"
  input: "to_gates/f_b_a"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "non-linearity/scalar"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -1.0
      }
    }
  }
}
node {
  name: "non-linearity/mul"
  op: "Mul"
  input: "non-linearity/scalar"
  input: "non-linearity/sigmoid_forget"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "non-linearity/ones"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 1
          }
          dim {
            size: 25
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "non-linearity/making_input_gate"
  op: "Add"
  input: "non-linearity/ones"
  input: "non-linearity/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "non-linearity/sigmoid_input"
  op: "Sigmoid"
  input: "non-linearity/making_input_gate"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "non-linearity/tanh_gate"
  op: "Tanh"
  input: "to_gates/g_b_a"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "forget_gate/forget_gating"
  op: "Mul"
  input: "non-linearity/sigmoid_forget"
  input: "placeholders/last_cell"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "suggestion_node/input_determiner"
  op: "Mul"
  input: "non-linearity/sigmoid_input"
  input: "non-linearity/tanh_gate"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "suggestion_node/input_and_gate_gating"
  op: "Add"
  input: "suggestion_node/input_determiner"
  input: "forget_gate/forget_gating"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "output_gate/input_concat/axis"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "output_gate/input_concat"
  op: "ConcatV2"
  input: "placeholders/input_placeholder"
  input: "placeholders/last_hidden"
  input: "suggestion_node/input_and_gate_gating"
  input: "output_gate/input_concat/axis"
  attr {
    key: "N"
    value {
      i: 3
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "output_gate/o_w_m"
  op: "MatMul"
  input: "output_gate/input_concat"
  input: "weights_and_biases/output_weight/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "output_gate/o_b_a"
  op: "Add"
  input: "output_gate/o_w_m"
  input: "weights_and_biases/output_bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "output_gate/sigmoid_output"
  op: "Sigmoid"
  input: "output_gate/o_b_a"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "output_gate/cell_squashing"
  op: "Tanh"
  input: "suggestion_node/input_and_gate_gating"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "output_gate/next_hidden"
  op: "Mul"
  input: "output_gate/sigmoid_output"
  input: "output_gate/cell_squashing"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "output_gate/WHTO_w_m"
  op: "MatMul"
  input: "output_gate/next_hidden"
  input: "weights_and_biases/outwards_propagating_weight/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "output_gate/BHTO_b_a"
  op: "Add"
  input: "output_gate/WHTO_w_m"
  input: "weights_and_biases/outwards_propagating_bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "output_gate/output"
  op: "Relu"
  input: "output_gate/BHTO_b_a"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "loss/Sub"
  op: "Sub"
  input: "output_gate/output"
  input: "placeholders/label"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "loss/Square"
  op: "Square"
  input: "loss/Sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "loss/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "loss/Sum"
  op: "Sum"
  input: "loss/Square"
  input: "loss/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "optimizer/gradients/Shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "optimizer/gradients/grad_ys_0"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "optimizer/gradients/Fill"
  op: "Fill"
  input: "optimizer/gradients/Shape"
  input: "optimizer/gradients/grad_ys_0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "optimizer/gradients/loss/Sum_grad/Reshape/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "optimizer/gradients/loss/Sum_grad/Reshape"
  op: "Reshape"
  input: "optimizer/gradients/Fill"
  input: "optimizer/gradients/loss/Sum_grad/Reshape/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "optimizer/gradients/loss/Sum_grad/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "optimizer/gradients/loss/Sum_grad/Tile"
  op: "Tile"
  input: "optimizer/gradients/loss/Sum_grad/Reshape"
  input: "optimizer/gradients/loss/Sum_grad/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "optimizer/gradients/loss/Square_grad/Const"
  op: "Const"
  input: "^optimizer/gradients/loss/Sum_grad/Tile"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 2.0
      }
    }
  }
}
node {
  name: "optimizer/gradients/loss/Square_grad/Mul"
  op: "Mul"
  input: "loss/Sub"
  input: "optimizer/gradients/loss/Square_grad/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "optimizer/gradients/loss/Square_grad/Mul_1"
  op: "Mul"
  input: "optimizer/gradients/loss/Sum_grad/Tile"
  input: "optimizer/gradients/loss/Square_grad/Mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "optimizer/gradients/loss/Sub_grad/Neg"
  op: "Neg"
  input: "optimizer/gradients/loss/Square_grad/Mul_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "optimizer/gradients/loss/Sub_grad/tuple/group_deps"
  op: "NoOp"
  input: "^optimizer/gradients/loss/Square_grad/Mul_1"
  input: "^optimizer/gradients/loss/Sub_grad/Neg"
}
node {
  name: "optimizer/gradients/loss/Sub_grad/tuple/control_dependency"
  op: "Identity"
  input: "optimizer/gradients/loss/Square_grad/Mul_1"
  input: "^optimizer/gradients/loss/Sub_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@optimizer/gradients/loss/Square_grad/Mul_1"
      }
    }
  }
}
node {
  name: "optimizer/gradients/loss/Sub_grad/tuple/control_dependency_1"
  op: "Identity"
  input: "optimizer/gradients/loss/Sub_grad/Neg"
  input: "^optimizer/gradients/loss/Sub_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@optimizer/gradients/loss/Sub_grad/Neg"
      }
    }
  }
}
node {
  name: "optimizer/gradients/output_gate/output_grad/ReluGrad"
  op: "ReluGrad"
  input: "optimizer/gradients/loss/Sub_grad/tuple/control_dependency"
  input: "output_gate/output"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "optimizer/gradients/output_gate/BHTO_b_a_grad/tuple/group_deps"
  op: "NoOp"
  input: "^optimizer/gradients/output_gate/output_grad/ReluGrad"
}
node {
  name: "optimizer/gradients/output_gate/BHTO_b_a_grad/tuple/control_dependency"
  op: "Identity"
  input: "optimizer/gradients/output_gate/output_grad/ReluGrad"
  input: "^optimizer/gradients/output_gate/BHTO_b_a_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@optimizer/gradients/output_gate/output_grad/ReluGrad"
      }
    }
  }
}
node {
  name: "optimizer/gradients/output_gate/BHTO_b_a_grad/tuple/control_dependency_1"
  op: "Identity"
  input: "optimizer/gradients/output_gate/output_grad/ReluGrad"
  input: "^optimizer/gradients/output_gate/BHTO_b_a_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@optimizer/gradients/output_gate/output_grad/ReluGrad"
      }
    }
  }
}
node {
  name: "optimizer/gradients/output_gate/WHTO_w_m_grad/MatMul"
  op: "MatMul"
  input: "optimizer/gradients/output_gate/BHTO_b_a_grad/tuple/control_dependency"
  input: "weights_and_biases/outwards_propagating_weight/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: true
    }
  }
}
node {
  name: "optimizer/gradients/output_gate/WHTO_w_m_grad/MatMul_1"
  op: "MatMul"
  input: "output_gate/next_hidden"
  input: "optimizer/gradients/output_gate/BHTO_b_a_grad/tuple/control_dependency"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: true
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "optimizer/gradients/output_gate/WHTO_w_m_grad/tuple/group_deps"
  op: "NoOp"
  input: "^optimizer/gradients/output_gate/WHTO_w_m_grad/MatMul"
  input: "^optimizer/gradients/output_gate/WHTO_w_m_grad/MatMul_1"
}
node {
  name: "optimizer/gradients/output_gate/WHTO_w_m_grad/tuple/control_dependency"
  op: "Identity"
  input: "optimizer/gradients/output_gate/WHTO_w_m_grad/MatMul"
  input: "^optimizer/gradients/output_gate/WHTO_w_m_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@optimizer/gradients/output_gate/WHTO_w_m_grad/MatMul"
      }
    }
  }
}
node {
  name: "optimizer/gradients/output_gate/WHTO_w_m_grad/tuple/control_dependency_1"
  op: "Identity"
  input: "optimizer/gradients/output_gate/WHTO_w_m_grad/MatMul_1"
  input: "^optimizer/gradients/output_gate/WHTO_w_m_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@optimizer/gradients/output_gate/WHTO_w_m_grad/MatMul_1"
      }
    }
  }
}
node {
  name: "optimizer/gradients/output_gate/next_hidden_grad/Mul"
  op: "Mul"
  input: "optimizer/gradients/output_gate/WHTO_w_m_grad/tuple/control_dependency"
  input: "output_gate/cell_squashing"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "optimizer/gradients/output_gate/next_hidden_grad/Mul_1"
  op: "Mul"
  input: "optimizer/gradients/output_gate/WHTO_w_m_grad/tuple/control_dependency"
  input: "output_gate/sigmoid_output"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "optimizer/gradients/output_gate/next_hidden_grad/tuple/group_deps"
  op: "NoOp"
  input: "^optimizer/gradients/output_gate/next_hidden_grad/Mul"
  input: "^optimizer/gradients/output_gate/next_hidden_grad/Mul_1"
}
node {
  name: "optimizer/gradients/output_gate/next_hidden_grad/tuple/control_dependency"
  op: "Identity"
  input: "optimizer/gradients/output_gate/next_hidden_grad/Mul"
  input: "^optimizer/gradients/output_gate/next_hidden_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@optimizer/gradients/output_gate/next_hidden_grad/Mul"
      }
    }
  }
}
node {
  name: "optimizer/gradients/output_gate/next_hidden_grad/tuple/control_dependency_1"
  op: "Identity"
  input: "optimizer/gradients/output_gate/next_hidden_grad/Mul_1"
  input: "^optimizer/gradients/output_gate/next_hidden_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@optimizer/gradients/output_gate/next_hidden_grad/Mul_1"
      }
    }
  }
}
node {
  name: "optimizer/gradients/output_gate/sigmoid_output_grad/SigmoidGrad"
  op: "SigmoidGrad"
  input: "output_gate/sigmoid_output"
  input: "optimizer/gradients/output_gate/next_hidden_grad/tuple/control_dependency"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "optimizer/gradients/output_gate/cell_squashing_grad/TanhGrad"
  op: "TanhGrad"
  input: "output_gate/cell_squashing"
  input: "optimizer/gradients/output_gate/next_hidden_grad/tuple/control_dependency_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "optimizer/gradients/output_gate/o_b_a_grad/tuple/group_deps"
  op: "NoOp"
  input: "^optimizer/gradients/output_gate/sigmoid_output_grad/SigmoidGrad"
}
node {
  name: "optimizer/gradients/output_gate/o_b_a_grad/tuple/control_dependency"
  op: "Identity"
  input: "optimizer/gradients/output_gate/sigmoid_output_grad/SigmoidGrad"
  input: "^optimizer/gradients/output_gate/o_b_a_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@optimizer/gradients/output_gate/sigmoid_output_grad/SigmoidGrad"
      }
    }
  }
}
node {
  name: "optimizer/gradients/output_gate/o_b_a_grad/tuple/control_dependency_1"
  op: "Identity"
  input: "optimizer/gradients/output_gate/sigmoid_output_grad/SigmoidGrad"
  input: "^optimizer/gradients/output_gate/o_b_a_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@optimizer/gradients/output_gate/sigmoid_output_grad/SigmoidGrad"
      }
    }
  }
}
node {
  name: "optimizer/gradients/output_gate/o_w_m_grad/MatMul"
  op: "MatMul"
  input: "optimizer/gradients/output_gate/o_b_a_grad/tuple/control_dependency"
  input: "weights_and_biases/output_weight/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: true
    }
  }
}
node {
  name: "optimizer/gradients/output_gate/o_w_m_grad/MatMul_1"
  op: "MatMul"
  input: "output_gate/input_concat"
  input: "optimizer/gradients/output_gate/o_b_a_grad/tuple/control_dependency"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: true
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "optimizer/gradients/output_gate/o_w_m_grad/tuple/group_deps"
  op: "NoOp"
  input: "^optimizer/gradients/output_gate/o_w_m_grad/MatMul"
  input: "^optimizer/gradients/output_gate/o_w_m_grad/MatMul_1"
}
node {
  name: "optimizer/gradients/output_gate/o_w_m_grad/tuple/control_dependency"
  op: "Identity"
  input: "optimizer/gradients/output_gate/o_w_m_grad/MatMul"
  input: "^optimizer/gradients/output_gate/o_w_m_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@optimizer/gradients/output_gate/o_w_m_grad/MatMul"
      }
    }
  }
}
node {
  name: "optimizer/gradients/output_gate/o_w_m_grad/tuple/control_dependency_1"
  op: "Identity"
  input: "optimizer/gradients/output_gate/o_w_m_grad/MatMul_1"
  input: "^optimizer/gradients/output_gate/o_w_m_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@optimizer/gradients/output_gate/o_w_m_grad/MatMul_1"
      }
    }
  }
}
node {
  name: "optimizer/gradients/output_gate/input_concat_grad/Rank"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 2
      }
    }
  }
}
node {
  name: "optimizer/gradients/output_gate/input_concat_grad/mod"
  op: "FloorMod"
  input: "output_gate/input_concat/axis"
  input: "optimizer/gradients/output_gate/input_concat_grad/Rank"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "optimizer/gradients/output_gate/input_concat_grad/Shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "optimizer/gradients/output_gate/input_concat_grad/Shape_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\031\000\000\000"
      }
    }
  }
}
node {
  name: "optimizer/gradients/output_gate/input_concat_grad/Shape_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\031\000\000\000"
      }
    }
  }
}
node {
  name: "optimizer/gradients/output_gate/input_concat_grad/ConcatOffset"
  op: "ConcatOffset"
  input: "optimizer/gradients/output_gate/input_concat_grad/mod"
  input: "optimizer/gradients/output_gate/input_concat_grad/Shape"
  input: "optimizer/gradients/output_gate/input_concat_grad/Shape_1"
  input: "optimizer/gradients/output_gate/input_concat_grad/Shape_2"
  attr {
    key: "N"
    value {
      i: 3
    }
  }
}
node {
  name: "optimizer/gradients/output_gate/input_concat_grad/Slice"
  op: "Slice"
  input: "optimizer/gradients/output_gate/o_w_m_grad/tuple/control_dependency"
  input: "optimizer/gradients/output_gate/input_concat_grad/ConcatOffset"
  input: "optimizer/gradients/output_gate/input_concat_grad/Shape"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "optimizer/gradients/output_gate/input_concat_grad/Slice_1"
  op: "Slice"
  input: "optimizer/gradients/output_gate/o_w_m_grad/tuple/control_dependency"
  input: "optimizer/gradients/output_gate/input_concat_grad/ConcatOffset:1"
  input: "optimizer/gradients/output_gate/input_concat_grad/Shape_1"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "optimizer/gradients/output_gate/input_concat_grad/Slice_2"
  op: "Slice"
  input: "optimizer/gradients/output_gate/o_w_m_grad/tuple/control_dependency"
  input: "optimizer/gradients/output_gate/input_concat_grad/ConcatOffset:2"
  input: "optimizer/gradients/output_gate/input_concat_grad/Shape_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "optimizer/gradients/output_gate/input_concat_grad/tuple/group_deps"
  op: "NoOp"
  input: "^optimizer/gradients/output_gate/input_concat_grad/Slice"
  input: "^optimizer/gradients/output_gate/input_concat_grad/Slice_1"
  input: "^optimizer/gradients/output_gate/input_concat_grad/Slice_2"
}
node {
  name: "optimizer/gradients/output_gate/input_concat_grad/tuple/control_dependency"
  op: "Identity"
  input: "optimizer/gradients/output_gate/input_concat_grad/Slice"
  input: "^optimizer/gradients/output_gate/input_concat_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@optimizer/gradients/output_gate/input_concat_grad/Slice"
      }
    }
  }
}
node {
  name: "optimizer/gradients/output_gate/input_concat_grad/tuple/control_dependency_1"
  op: "Identity"
  input: "optimizer/gradients/output_gate/input_concat_grad/Slice_1"
  input: "^optimizer/gradients/output_gate/input_concat_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@optimizer/gradients/output_gate/input_concat_grad/Slice_1"
      }
    }
  }
}
node {
  name: "optimizer/gradients/output_gate/input_concat_grad/tuple/control_dependency_2"
  op: "Identity"
  input: "optimizer/gradients/output_gate/input_concat_grad/Slice_2"
  input: "^optimizer/gradients/output_gate/input_concat_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@optimizer/gradients/output_gate/input_concat_grad/Slice_2"
      }
    }
  }
}
node {
  name: "optimizer/gradients/AddN"
  op: "AddN"
  input: "optimizer/gradients/output_gate/cell_squashing_grad/TanhGrad"
  input: "optimizer/gradients/output_gate/input_concat_grad/tuple/control_dependency_2"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@optimizer/gradients/output_gate/cell_squashing_grad/TanhGrad"
      }
    }
  }
}
node {
  name: "optimizer/gradients/suggestion_node/input_and_gate_gating_grad/tuple/group_deps"
  op: "NoOp"
  input: "^optimizer/gradients/AddN"
}
node {
  name: "optimizer/gradients/suggestion_node/input_and_gate_gating_grad/tuple/control_dependency"
  op: "Identity"
  input: "optimizer/gradients/AddN"
  input: "^optimizer/gradients/suggestion_node/input_and_gate_gating_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@optimizer/gradients/output_gate/cell_squashing_grad/TanhGrad"
      }
    }
  }
}
node {
  name: "optimizer/gradients/suggestion_node/input_and_gate_gating_grad/tuple/control_dependency_1"
  op: "Identity"
  input: "optimizer/gradients/AddN"
  input: "^optimizer/gradients/suggestion_node/input_and_gate_gating_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@optimizer/gradients/output_gate/cell_squashing_grad/TanhGrad"
      }
    }
  }
}
node {
  name: "optimizer/gradients/suggestion_node/input_determiner_grad/Mul"
  op: "Mul"
  input: "optimizer/gradients/suggestion_node/input_and_gate_gating_grad/tuple/control_dependency"
  input: "non-linearity/tanh_gate"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "optimizer/gradients/suggestion_node/input_determiner_grad/Mul_1"
  op: "Mul"
  input: "optimizer/gradients/suggestion_node/input_and_gate_gating_grad/tuple/control_dependency"
  input: "non-linearity/sigmoid_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "optimizer/gradients/suggestion_node/input_determiner_grad/tuple/group_deps"
  op: "NoOp"
  input: "^optimizer/gradients/suggestion_node/input_determiner_grad/Mul"
  input: "^optimizer/gradients/suggestion_node/input_determiner_grad/Mul_1"
}
node {
  name: "optimizer/gradients/suggestion_node/input_determiner_grad/tuple/control_dependency"
  op: "Identity"
  input: "optimizer/gradients/suggestion_node/input_determiner_grad/Mul"
  input: "^optimizer/gradients/suggestion_node/input_determiner_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@optimizer/gradients/suggestion_node/input_determiner_grad/Mul"
      }
    }
  }
}
node {
  name: "optimizer/gradients/suggestion_node/input_determiner_grad/tuple/control_dependency_1"
  op: "Identity"
  input: "optimizer/gradients/suggestion_node/input_determiner_grad/Mul_1"
  input: "^optimizer/gradients/suggestion_node/input_determiner_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@optimizer/gradients/suggestion_node/input_determiner_grad/Mul_1"
      }
    }
  }
}
node {
  name: "optimizer/gradients/forget_gate/forget_gating_grad/Mul"
  op: "Mul"
  input: "optimizer/gradients/suggestion_node/input_and_gate_gating_grad/tuple/control_dependency_1"
  input: "placeholders/last_cell"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "optimizer/gradients/forget_gate/forget_gating_grad/Mul_1"
  op: "Mul"
  input: "optimizer/gradients/suggestion_node/input_and_gate_gating_grad/tuple/control_dependency_1"
  input: "non-linearity/sigmoid_forget"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "optimizer/gradients/forget_gate/forget_gating_grad/tuple/group_deps"
  op: "NoOp"
  input: "^optimizer/gradients/forget_gate/forget_gating_grad/Mul"
  input: "^optimizer/gradients/forget_gate/forget_gating_grad/Mul_1"
}
node {
  name: "optimizer/gradients/forget_gate/forget_gating_grad/tuple/control_dependency"
  op: "Identity"
  input: "optimizer/gradients/forget_gate/forget_gating_grad/Mul"
  input: "^optimizer/gradients/forget_gate/forget_gating_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@optimizer/gradients/forget_gate/forget_gating_grad/Mul"
      }
    }
  }
}
node {
