node {
  name: "placeholders/label"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 1
        }
      }
    }
  }
}
node {
  name: "placeholders/initial_states_1"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 2
        }
        dim {
          size: 1
        }
        dim {
          size: 25
        }
      }
    }
  }
}
node {
  name: "placeholders/initial_states_2"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 2
        }
        dim {
          size: 1
        }
        dim {
          size: 25
        }
      }
    }
  }
}
node {
  name: "placeholders/input_data"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 9
        }
        dim {
          size: 1
        }
        dim {
          size: 1
        }
      }
    }
  }
}
node {
  name: "aux_weights_and_biases/random_normal/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\031\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "aux_weights_and_biases/random_normal/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "aux_weights_and_biases/random_normal/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "aux_weights_and_biases/random_normal/RandomStandardNormal"
  op: "RandomStandardNormal"
  input: "aux_weights_and_biases/random_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "aux_weights_and_biases/random_normal/mul"
  op: "Mul"
  input: "aux_weights_and_biases/random_normal/RandomStandardNormal"
  input: "aux_weights_and_biases/random_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "aux_weights_and_biases/random_normal"
  op: "Add"
  input: "aux_weights_and_biases/random_normal/mul"
  input: "aux_weights_and_biases/random_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "aux_weights_and_biases/outwards_propagating_weight_1"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 25
        }
        dim {
          size: 1
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "aux_weights_and_biases/outwards_propagating_weight_1/Assign"
  op: "Assign"
  input: "aux_weights_and_biases/outwards_propagating_weight_1"
  input: "aux_weights_and_biases/random_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@aux_weights_and_biases/outwards_propagating_weight_1"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "aux_weights_and_biases/outwards_propagating_weight_1/read"
  op: "Identity"
  input: "aux_weights_and_biases/outwards_propagating_weight_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@aux_weights_and_biases/outwards_propagating_weight_1"
      }
    }
  }
}
node {
  name: "aux_weights_and_biases/random_normal_1/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\031\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "aux_weights_and_biases/random_normal_1/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "aux_weights_and_biases/random_normal_1/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "aux_weights_and_biases/random_normal_1/RandomStandardNormal"
  op: "RandomStandardNormal"
  input: "aux_weights_and_biases/random_normal_1/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "aux_weights_and_biases/random_normal_1/mul"
  op: "Mul"
  input: "aux_weights_and_biases/random_normal_1/RandomStandardNormal"
  input: "aux_weights_and_biases/random_normal_1/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "aux_weights_and_biases/random_normal_1"
  op: "Add"
  input: "aux_weights_and_biases/random_normal_1/mul"
  input: "aux_weights_and_biases/random_normal_1/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "aux_weights_and_biases/outwards_propagating_weight_2"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 25
        }
        dim {
          size: 1
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "aux_weights_and_biases/outwards_propagating_weight_2/Assign"
  op: "Assign"
  input: "aux_weights_and_biases/outwards_propagating_weight_2"
  input: "aux_weights_and_biases/random_normal_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@aux_weights_and_biases/outwards_propagating_weight_2"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "aux_weights_and_biases/outwards_propagating_weight_2/read"
  op: "Identity"
  input: "aux_weights_and_biases/outwards_propagating_weight_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@aux_weights_and_biases/outwards_propagating_weight_2"
      }
    }
  }
}
node {
  name: "aux_weights_and_biases/zeros"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 1
          }
          dim {
            size: 1
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "aux_weights_and_biases/outwards_propagating_bias_1"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 1
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "aux_weights_and_biases/outwards_propagating_bias_1/Assign"
  op: "Assign"
  input: "aux_weights_and_biases/outwards_propagating_bias_1"
  input: "aux_weights_and_biases/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@aux_weights_and_biases/outwards_propagating_bias_1"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "aux_weights_and_biases/outwards_propagating_bias_1/read"
  op: "Identity"
  input: "aux_weights_and_biases/outwards_propagating_bias_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@aux_weights_and_biases/outwards_propagating_bias_1"
      }
    }
  }
}
node {
  name: "aux_weights_and_biases/zeros_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 1
          }
          dim {
            size: 1
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "aux_weights_and_biases/outwards_propagating_bias_2"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 1
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "aux_weights_and_biases/outwards_propagating_bias_2/Assign"
  op: "Assign"
  input: "aux_weights_and_biases/outwards_propagating_bias_2"
  input: "aux_weights_and_biases/zeros_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@aux_weights_and_biases/outwards_propagating_bias_2"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "aux_weights_and_biases/outwards_propagating_bias_2/read"
  op: "Identity"
  input: "aux_weights_and_biases/outwards_propagating_bias_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@aux_weights_and_biases/outwards_propagating_bias_2"
      }
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/weights_and_biases/random_normal/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\032\000\000\000\031\000\000\000"
      }
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/weights_and_biases/random_normal/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/weights_and_biases/random_normal/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/weights_and_biases/random_normal/RandomStandardNormal"
  op: "RandomStandardNormal"
  input: "layer_1_propagation/layer_1/weights_and_biases/random_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/weights_and_biases/random_normal/mul"
  op: "Mul"
  input: "layer_1_propagation/layer_1/weights_and_biases/random_normal/RandomStandardNormal"
  input: "layer_1_propagation/layer_1/weights_and_biases/random_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/weights_and_biases/random_normal"
  op: "Add"
  input: "layer_1_propagation/layer_1/weights_and_biases/random_normal/mul"
  input: "layer_1_propagation/layer_1/weights_and_biases/random_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/weights_and_biases/forget_weight"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 26
        }
        dim {
          size: 25
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/weights_and_biases/forget_weight/Assign"
  op: "Assign"
  input: "layer_1_propagation/layer_1/weights_and_biases/forget_weight"
  input: "layer_1_propagation/layer_1/weights_and_biases/random_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer_1_propagation/layer_1/weights_and_biases/forget_weight"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/weights_and_biases/forget_weight/read"
  op: "Identity"
  input: "layer_1_propagation/layer_1/weights_and_biases/forget_weight"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer_1_propagation/layer_1/weights_and_biases/forget_weight"
      }
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/weights_and_biases/random_normal_1/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\032\000\000\000\031\000\000\000"
      }
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/weights_and_biases/random_normal_1/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/weights_and_biases/random_normal_1/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/weights_and_biases/random_normal_1/RandomStandardNormal"
  op: "RandomStandardNormal"
  input: "layer_1_propagation/layer_1/weights_and_biases/random_normal_1/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/weights_and_biases/random_normal_1/mul"
  op: "Mul"
  input: "layer_1_propagation/layer_1/weights_and_biases/random_normal_1/RandomStandardNormal"
  input: "layer_1_propagation/layer_1/weights_and_biases/random_normal_1/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/weights_and_biases/random_normal_1"
  op: "Add"
  input: "layer_1_propagation/layer_1/weights_and_biases/random_normal_1/mul"
  input: "layer_1_propagation/layer_1/weights_and_biases/random_normal_1/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/weights_and_biases/output_weight"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 26
        }
        dim {
          size: 25
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/weights_and_biases/output_weight/Assign"
  op: "Assign"
  input: "layer_1_propagation/layer_1/weights_and_biases/output_weight"
  input: "layer_1_propagation/layer_1/weights_and_biases/random_normal_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer_1_propagation/layer_1/weights_and_biases/output_weight"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/weights_and_biases/output_weight/read"
  op: "Identity"
  input: "layer_1_propagation/layer_1/weights_and_biases/output_weight"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer_1_propagation/layer_1/weights_and_biases/output_weight"
      }
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/weights_and_biases/random_normal_2/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\032\000\000\000\031\000\000\000"
      }
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/weights_and_biases/random_normal_2/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/weights_and_biases/random_normal_2/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/weights_and_biases/random_normal_2/RandomStandardNormal"
  op: "RandomStandardNormal"
  input: "layer_1_propagation/layer_1/weights_and_biases/random_normal_2/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/weights_and_biases/random_normal_2/mul"
  op: "Mul"
  input: "layer_1_propagation/layer_1/weights_and_biases/random_normal_2/RandomStandardNormal"
  input: "layer_1_propagation/layer_1/weights_and_biases/random_normal_2/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/weights_and_biases/random_normal_2"
  op: "Add"
  input: "layer_1_propagation/layer_1/weights_and_biases/random_normal_2/mul"
  input: "layer_1_propagation/layer_1/weights_and_biases/random_normal_2/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/weights_and_biases/gate_weight"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 26
        }
        dim {
          size: 25
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/weights_and_biases/gate_weight/Assign"
  op: "Assign"
  input: "layer_1_propagation/layer_1/weights_and_biases/gate_weight"
  input: "layer_1_propagation/layer_1/weights_and_biases/random_normal_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer_1_propagation/layer_1/weights_and_biases/gate_weight"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/weights_and_biases/gate_weight/read"
  op: "Identity"
  input: "layer_1_propagation/layer_1/weights_and_biases/gate_weight"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer_1_propagation/layer_1/weights_and_biases/gate_weight"
      }
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/weights_and_biases/random_normal_3/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\032\000\000\000\031\000\000\000"
      }
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/weights_and_biases/random_normal_3/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/weights_and_biases/random_normal_3/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/weights_and_biases/random_normal_3/RandomStandardNormal"
  op: "RandomStandardNormal"
  input: "layer_1_propagation/layer_1/weights_and_biases/random_normal_3/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/weights_and_biases/random_normal_3/mul"
  op: "Mul"
  input: "layer_1_propagation/layer_1/weights_and_biases/random_normal_3/RandomStandardNormal"
  input: "layer_1_propagation/layer_1/weights_and_biases/random_normal_3/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/weights_and_biases/random_normal_3"
  op: "Add"
  input: "layer_1_propagation/layer_1/weights_and_biases/random_normal_3/mul"
  input: "layer_1_propagation/layer_1/weights_and_biases/random_normal_3/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/weights_and_biases/input_weight"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 26
        }
        dim {
          size: 25
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/weights_and_biases/input_weight/Assign"
  op: "Assign"
  input: "layer_1_propagation/layer_1/weights_and_biases/input_weight"
  input: "layer_1_propagation/layer_1/weights_and_biases/random_normal_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer_1_propagation/layer_1/weights_and_biases/input_weight"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/weights_and_biases/input_weight/read"
  op: "Identity"
  input: "layer_1_propagation/layer_1/weights_and_biases/input_weight"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer_1_propagation/layer_1/weights_and_biases/input_weight"
      }
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/weights_and_biases/random_normal_4/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\031\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/weights_and_biases/random_normal_4/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/weights_and_biases/random_normal_4/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/weights_and_biases/random_normal_4/RandomStandardNormal"
  op: "RandomStandardNormal"
  input: "layer_1_propagation/layer_1/weights_and_biases/random_normal_4/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/weights_and_biases/random_normal_4/mul"
  op: "Mul"
  input: "layer_1_propagation/layer_1/weights_and_biases/random_normal_4/RandomStandardNormal"
  input: "layer_1_propagation/layer_1/weights_and_biases/random_normal_4/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/weights_and_biases/random_normal_4"
  op: "Add"
  input: "layer_1_propagation/layer_1/weights_and_biases/random_normal_4/mul"
  input: "layer_1_propagation/layer_1/weights_and_biases/random_normal_4/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/weights_and_biases/outwards_propagating_weight"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 25
        }
        dim {
          size: 1
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/weights_and_biases/outwards_propagating_weight/Assign"
  op: "Assign"
  input: "layer_1_propagation/layer_1/weights_and_biases/outwards_propagating_weight"
  input: "layer_1_propagation/layer_1/weights_and_biases/random_normal_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer_1_propagation/layer_1/weights_and_biases/outwards_propagating_weight"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/weights_and_biases/outwards_propagating_weight/read"
  op: "Identity"
  input: "layer_1_propagation/layer_1/weights_and_biases/outwards_propagating_weight"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer_1_propagation/layer_1/weights_and_biases/outwards_propagating_weight"
      }
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/weights_and_biases/zeros"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 1
          }
          dim {
            size: 25
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/weights_and_biases/forget_bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 25
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/weights_and_biases/forget_bias/Assign"
  op: "Assign"
  input: "layer_1_propagation/layer_1/weights_and_biases/forget_bias"
  input: "layer_1_propagation/layer_1/weights_and_biases/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer_1_propagation/layer_1/weights_and_biases/forget_bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/weights_and_biases/forget_bias/read"
  op: "Identity"
  input: "layer_1_propagation/layer_1/weights_and_biases/forget_bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer_1_propagation/layer_1/weights_and_biases/forget_bias"
      }
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/weights_and_biases/zeros_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 1
          }
          dim {
            size: 25
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/weights_and_biases/output_bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 25
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/weights_and_biases/output_bias/Assign"
  op: "Assign"
  input: "layer_1_propagation/layer_1/weights_and_biases/output_bias"
  input: "layer_1_propagation/layer_1/weights_and_biases/zeros_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer_1_propagation/layer_1/weights_and_biases/output_bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/weights_and_biases/output_bias/read"
  op: "Identity"
  input: "layer_1_propagation/layer_1/weights_and_biases/output_bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer_1_propagation/layer_1/weights_and_biases/output_bias"
      }
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/weights_and_biases/zeros_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 1
          }
          dim {
            size: 25
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/weights_and_biases/gate_bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 25
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/weights_and_biases/gate_bias/Assign"
  op: "Assign"
  input: "layer_1_propagation/layer_1/weights_and_biases/gate_bias"
  input: "layer_1_propagation/layer_1/weights_and_biases/zeros_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer_1_propagation/layer_1/weights_and_biases/gate_bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/weights_and_biases/gate_bias/read"
  op: "Identity"
  input: "layer_1_propagation/layer_1/weights_and_biases/gate_bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer_1_propagation/layer_1/weights_and_biases/gate_bias"
      }
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/weights_and_biases/zeros_3"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 1
          }
          dim {
            size: 25
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/weights_and_biases/input_bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 25
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/weights_and_biases/input_bias/Assign"
  op: "Assign"
  input: "layer_1_propagation/layer_1/weights_and_biases/input_bias"
  input: "layer_1_propagation/layer_1/weights_and_biases/zeros_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer_1_propagation/layer_1/weights_and_biases/input_bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/weights_and_biases/input_bias/read"
  op: "Identity"
  input: "layer_1_propagation/layer_1/weights_and_biases/input_bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer_1_propagation/layer_1/weights_and_biases/input_bias"
      }
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/weights_and_biases/zeros_4"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 1
          }
          dim {
            size: 1
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/weights_and_biases/outwards_propagating_bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 1
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/weights_and_biases/outwards_propagating_bias/Assign"
  op: "Assign"
  input: "layer_1_propagation/layer_1/weights_and_biases/outwards_propagating_bias"
  input: "layer_1_propagation/layer_1/weights_and_biases/zeros_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer_1_propagation/layer_1/weights_and_biases/outwards_propagating_bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/weights_and_biases/outwards_propagating_bias/read"
  op: "Identity"
  input: "layer_1_propagation/layer_1/weights_and_biases/outwards_propagating_bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer_1_propagation/layer_1/weights_and_biases/outwards_propagating_bias"
      }
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/forward_roll/scan/TensorArray/size"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 9
      }
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/forward_roll/scan/TensorArray"
  op: "TensorArrayV3"
  input: "layer_1_propagation/layer_1/forward_roll/scan/TensorArray/size"
  attr {
    key: "clear_after_read"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "dynamic_size"
    value {
      b: false
    }
  }
  attr {
    key: "element_shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
  attr {
    key: "identical_element_shapes"
    value {
      b: true
    }
  }
  attr {
    key: "tensor_array_name"
    value {
      s: ""
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/forward_roll/scan/TensorArrayUnstack/Shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\t\000\000\000\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/forward_roll/scan/TensorArrayUnstack/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/forward_roll/scan/TensorArrayUnstack/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/forward_roll/scan/TensorArrayUnstack/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/forward_roll/scan/TensorArrayUnstack/strided_slice"
  op: "StridedSlice"
  input: "layer_1_propagation/layer_1/forward_roll/scan/TensorArrayUnstack/Shape"
  input: "layer_1_propagation/layer_1/forward_roll/scan/TensorArrayUnstack/strided_slice/stack"
  input: "layer_1_propagation/layer_1/forward_roll/scan/TensorArrayUnstack/strided_slice/stack_1"
  input: "layer_1_propagation/layer_1/forward_roll/scan/TensorArrayUnstack/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/forward_roll/scan/TensorArrayUnstack/range/start"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/forward_roll/scan/TensorArrayUnstack/range/delta"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/forward_roll/scan/TensorArrayUnstack/range"
  op: "Range"
  input: "layer_1_propagation/layer_1/forward_roll/scan/TensorArrayUnstack/range/start"
  input: "layer_1_propagation/layer_1/forward_roll/scan/TensorArrayUnstack/strided_slice"
  input: "layer_1_propagation/layer_1/forward_roll/scan/TensorArrayUnstack/range/delta"
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/forward_roll/scan/TensorArrayUnstack/TensorArrayScatter/TensorArrayScatterV3"
  op: "TensorArrayScatterV3"
  input: "layer_1_propagation/layer_1/forward_roll/scan/TensorArray"
  input: "layer_1_propagation/layer_1/forward_roll/scan/TensorArrayUnstack/range"
  input: "placeholders/input_data"
  input: "layer_1_propagation/layer_1/forward_roll/scan/TensorArray:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@placeholders/input_data"
      }
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/forward_roll/scan/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/forward_roll/scan/TensorArray_1/size"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 9
      }
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/forward_roll/scan/TensorArray_1"
  op: "TensorArrayV3"
  input: "layer_1_propagation/layer_1/forward_roll/scan/TensorArray_1/size"
  attr {
    key: "clear_after_read"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "dynamic_size"
    value {
      b: false
    }
  }
  attr {
    key: "element_shape"
    value {
      shape {
        dim {
          size: 2
        }
        dim {
          size: 1
        }
        dim {
          size: 25
        }
      }
    }
  }
  attr {
    key: "identical_element_shapes"
    value {
      b: true
    }
  }
  attr {
    key: "tensor_array_name"
    value {
      s: ""
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/forward_roll/scan/while/maximum_iterations"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 9
      }
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/forward_roll/scan/while/iteration_counter"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/forward_roll/scan/while/Enter"
  op: "Enter"
  input: "layer_1_propagation/layer_1/forward_roll/scan/while/iteration_counter"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "frame_name"
    value {
      s: "layer_1_propagation/layer_1/forward_roll/scan/while/while_context"
    }
  }
  attr {
    key: "is_constant"
    value {
      b: false
    }
  }
  attr {
    key: "parallel_iterations"
    value {
      i: 10
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/forward_roll/scan/while/Enter_1"
  op: "Enter"
  input: "layer_1_propagation/layer_1/forward_roll/scan/Const"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "frame_name"
    value {
      s: "layer_1_propagation/layer_1/forward_roll/scan/while/while_context"
    }
  }
  attr {
    key: "is_constant"
    value {
      b: false
    }
  }
  attr {
    key: "parallel_iterations"
    value {
      i: 10
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/forward_roll/scan/while/Enter_2"
  op: "Enter"
  input: "placeholders/initial_states_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "frame_name"
    value {
      s: "layer_1_propagation/layer_1/forward_roll/scan/while/while_context"
    }
  }
  attr {
    key: "is_constant"
    value {
      b: false
    }
  }
  attr {
    key: "parallel_iterations"
    value {
      i: 10
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/forward_roll/scan/while/Enter_3"
  op: "Enter"
  input: "layer_1_propagation/layer_1/forward_roll/scan/TensorArray_1:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "frame_name"
    value {
      s: "layer_1_propagation/layer_1/forward_roll/scan/while/while_context"
    }
  }
  attr {
    key: "is_constant"
    value {
      b: false
    }
  }
  attr {
    key: "parallel_iterations"
    value {
      i: 10
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/forward_roll/scan/while/Merge"
  op: "Merge"
  input: "layer_1_propagation/layer_1/forward_roll/scan/while/Enter"
  input: "layer_1_propagation/layer_1/forward_roll/scan/while/NextIteration"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/forward_roll/scan/while/Merge_1"
  op: "Merge"
  input: "layer_1_propagation/layer_1/forward_roll/scan/while/Enter_1"
  input: "layer_1_propagation/layer_1/forward_roll/scan/while/NextIteration_1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/forward_roll/scan/while/Merge_2"
  op: "Merge"
  input: "layer_1_propagation/layer_1/forward_roll/scan/while/Enter_2"
  input: "layer_1_propagation/layer_1/forward_roll/scan/while/NextIteration_2"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/forward_roll/scan/while/Merge_3"
  op: "Merge"
  input: "layer_1_propagation/layer_1/forward_roll/scan/while/Enter_3"
  input: "layer_1_propagation/layer_1/forward_roll/scan/while/NextIteration_3"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/forward_roll/scan/while/Less"
  op: "Less"
  input: "layer_1_propagation/layer_1/forward_roll/scan/while/Merge"
  input: "layer_1_propagation/layer_1/forward_roll/scan/while/Less/Enter"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "layer_1_propagation/layer_1/forward_roll/scan/while/Less/Enter"
  op: "Enter"
  input: "layer_1_propagation/layer_1/forward_roll/scan/while/maximum_iterations"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "frame_name"
    value {
      s: "layer_1_propagation/layer_1/forward_roll/scan/while/while_context"
    }
  }
  attr {
    key: "is_constant"
    value {
      b: true
    }
  }
  attr {
    key: "parallel_iterations"
    value {
      i: 10
    }
  }
}
node {
