node {
  name: "layer_1/weights_and_biases/random_normal/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\032\000\000\000\031\000\000\000"
      }
    }
  }
}
node {
  name: "layer_1/weights_and_biases/random_normal/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "layer_1/weights_and_biases/random_normal/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "layer_1/weights_and_biases/random_normal/RandomStandardNormal"
  op: "RandomStandardNormal"
  input: "layer_1/weights_and_biases/random_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "layer_1/weights_and_biases/random_normal/mul"
  op: "Mul"
  input: "layer_1/weights_and_biases/random_normal/RandomStandardNormal"
  input: "layer_1/weights_and_biases/random_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "layer_1/weights_and_biases/random_normal"
  op: "Add"
  input: "layer_1/weights_and_biases/random_normal/mul"
  input: "layer_1/weights_and_biases/random_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "layer_1/weights_and_biases/forget_weight"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 26
        }
        dim {
          size: 25
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "layer_1/weights_and_biases/forget_weight/Assign"
  op: "Assign"
  input: "layer_1/weights_and_biases/forget_weight"
  input: "layer_1/weights_and_biases/random_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer_1/weights_and_biases/forget_weight"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "layer_1/weights_and_biases/forget_weight/read"
  op: "Identity"
  input: "layer_1/weights_and_biases/forget_weight"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer_1/weights_and_biases/forget_weight"
      }
    }
  }
}
node {
  name: "layer_1/weights_and_biases/random_normal_1/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\032\000\000\000\031\000\000\000"
      }
    }
  }
}
node {
  name: "layer_1/weights_and_biases/random_normal_1/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "layer_1/weights_and_biases/random_normal_1/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "layer_1/weights_and_biases/random_normal_1/RandomStandardNormal"
  op: "RandomStandardNormal"
  input: "layer_1/weights_and_biases/random_normal_1/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "layer_1/weights_and_biases/random_normal_1/mul"
  op: "Mul"
  input: "layer_1/weights_and_biases/random_normal_1/RandomStandardNormal"
  input: "layer_1/weights_and_biases/random_normal_1/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "layer_1/weights_and_biases/random_normal_1"
  op: "Add"
  input: "layer_1/weights_and_biases/random_normal_1/mul"
  input: "layer_1/weights_and_biases/random_normal_1/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "layer_1/weights_and_biases/output_weight"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 26
        }
        dim {
          size: 25
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "layer_1/weights_and_biases/output_weight/Assign"
  op: "Assign"
  input: "layer_1/weights_and_biases/output_weight"
  input: "layer_1/weights_and_biases/random_normal_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer_1/weights_and_biases/output_weight"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "layer_1/weights_and_biases/output_weight/read"
  op: "Identity"
  input: "layer_1/weights_and_biases/output_weight"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer_1/weights_and_biases/output_weight"
      }
    }
  }
}
node {
  name: "layer_1/weights_and_biases/random_normal_2/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\032\000\000\000\031\000\000\000"
      }
    }
  }
}
node {
  name: "layer_1/weights_and_biases/random_normal_2/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "layer_1/weights_and_biases/random_normal_2/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "layer_1/weights_and_biases/random_normal_2/RandomStandardNormal"
  op: "RandomStandardNormal"
  input: "layer_1/weights_and_biases/random_normal_2/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "layer_1/weights_and_biases/random_normal_2/mul"
  op: "Mul"
  input: "layer_1/weights_and_biases/random_normal_2/RandomStandardNormal"
  input: "layer_1/weights_and_biases/random_normal_2/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "layer_1/weights_and_biases/random_normal_2"
  op: "Add"
  input: "layer_1/weights_and_biases/random_normal_2/mul"
  input: "layer_1/weights_and_biases/random_normal_2/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "layer_1/weights_and_biases/gate_weight"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 26
        }
        dim {
          size: 25
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "layer_1/weights_and_biases/gate_weight/Assign"
  op: "Assign"
  input: "layer_1/weights_and_biases/gate_weight"
  input: "layer_1/weights_and_biases/random_normal_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer_1/weights_and_biases/gate_weight"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "layer_1/weights_and_biases/gate_weight/read"
  op: "Identity"
  input: "layer_1/weights_and_biases/gate_weight"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer_1/weights_and_biases/gate_weight"
      }
    }
  }
}
node {
  name: "layer_1/weights_and_biases/random_normal_3/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\032\000\000\000\031\000\000\000"
      }
    }
  }
}
node {
  name: "layer_1/weights_and_biases/random_normal_3/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "layer_1/weights_and_biases/random_normal_3/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "layer_1/weights_and_biases/random_normal_3/RandomStandardNormal"
  op: "RandomStandardNormal"
  input: "layer_1/weights_and_biases/random_normal_3/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "layer_1/weights_and_biases/random_normal_3/mul"
  op: "Mul"
  input: "layer_1/weights_and_biases/random_normal_3/RandomStandardNormal"
  input: "layer_1/weights_and_biases/random_normal_3/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "layer_1/weights_and_biases/random_normal_3"
  op: "Add"
  input: "layer_1/weights_and_biases/random_normal_3/mul"
  input: "layer_1/weights_and_biases/random_normal_3/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "layer_1/weights_and_biases/input_weight"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 26
        }
        dim {
          size: 25
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "layer_1/weights_and_biases/input_weight/Assign"
  op: "Assign"
  input: "layer_1/weights_and_biases/input_weight"
  input: "layer_1/weights_and_biases/random_normal_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer_1/weights_and_biases/input_weight"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "layer_1/weights_and_biases/input_weight/read"
  op: "Identity"
  input: "layer_1/weights_and_biases/input_weight"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer_1/weights_and_biases/input_weight"
      }
    }
  }
}
node {
  name: "layer_1/weights_and_biases/random_normal_4/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\031\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "layer_1/weights_and_biases/random_normal_4/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "layer_1/weights_and_biases/random_normal_4/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "layer_1/weights_and_biases/random_normal_4/RandomStandardNormal"
  op: "RandomStandardNormal"
  input: "layer_1/weights_and_biases/random_normal_4/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "layer_1/weights_and_biases/random_normal_4/mul"
  op: "Mul"
  input: "layer_1/weights_and_biases/random_normal_4/RandomStandardNormal"
  input: "layer_1/weights_and_biases/random_normal_4/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "layer_1/weights_and_biases/random_normal_4"
  op: "Add"
  input: "layer_1/weights_and_biases/random_normal_4/mul"
  input: "layer_1/weights_and_biases/random_normal_4/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "layer_1/weights_and_biases/outwards_propagating_weight"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 25
        }
        dim {
          size: 1
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "layer_1/weights_and_biases/outwards_propagating_weight/Assign"
  op: "Assign"
  input: "layer_1/weights_and_biases/outwards_propagating_weight"
  input: "layer_1/weights_and_biases/random_normal_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer_1/weights_and_biases/outwards_propagating_weight"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "layer_1/weights_and_biases/outwards_propagating_weight/read"
  op: "Identity"
  input: "layer_1/weights_and_biases/outwards_propagating_weight"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer_1/weights_and_biases/outwards_propagating_weight"
      }
    }
  }
}
node {
  name: "layer_1/weights_and_biases/zeros"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 1
          }
          dim {
            size: 25
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "layer_1/weights_and_biases/forget_bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 25
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "layer_1/weights_and_biases/forget_bias/Assign"
  op: "Assign"
  input: "layer_1/weights_and_biases/forget_bias"
  input: "layer_1/weights_and_biases/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer_1/weights_and_biases/forget_bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "layer_1/weights_and_biases/forget_bias/read"
  op: "Identity"
  input: "layer_1/weights_and_biases/forget_bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer_1/weights_and_biases/forget_bias"
      }
    }
  }
}
node {
  name: "layer_1/weights_and_biases/zeros_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 1
          }
          dim {
            size: 25
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "layer_1/weights_and_biases/output_bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 25
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "layer_1/weights_and_biases/output_bias/Assign"
  op: "Assign"
  input: "layer_1/weights_and_biases/output_bias"
  input: "layer_1/weights_and_biases/zeros_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer_1/weights_and_biases/output_bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "layer_1/weights_and_biases/output_bias/read"
  op: "Identity"
  input: "layer_1/weights_and_biases/output_bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer_1/weights_and_biases/output_bias"
      }
    }
  }
}
node {
  name: "layer_1/weights_and_biases/zeros_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 1
          }
          dim {
            size: 25
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "layer_1/weights_and_biases/gate_bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 25
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "layer_1/weights_and_biases/gate_bias/Assign"
  op: "Assign"
  input: "layer_1/weights_and_biases/gate_bias"
  input: "layer_1/weights_and_biases/zeros_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer_1/weights_and_biases/gate_bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "layer_1/weights_and_biases/gate_bias/read"
  op: "Identity"
  input: "layer_1/weights_and_biases/gate_bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer_1/weights_and_biases/gate_bias"
      }
    }
  }
}
node {
  name: "layer_1/weights_and_biases/zeros_3"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 1
          }
          dim {
            size: 25
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "layer_1/weights_and_biases/input_bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 25
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "layer_1/weights_and_biases/input_bias/Assign"
  op: "Assign"
  input: "layer_1/weights_and_biases/input_bias"
  input: "layer_1/weights_and_biases/zeros_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer_1/weights_and_biases/input_bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "layer_1/weights_and_biases/input_bias/read"
  op: "Identity"
  input: "layer_1/weights_and_biases/input_bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer_1/weights_and_biases/input_bias"
      }
    }
  }
}
node {
  name: "layer_1/weights_and_biases/zeros_4"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 1
          }
          dim {
            size: 1
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "layer_1/weights_and_biases/outwards_propagating_bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 1
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "layer_1/weights_and_biases/outwards_propagating_bias/Assign"
  op: "Assign"
  input: "layer_1/weights_and_biases/outwards_propagating_bias"
  input: "layer_1/weights_and_biases/zeros_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer_1/weights_and_biases/outwards_propagating_bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "layer_1/weights_and_biases/outwards_propagating_bias/read"
  op: "Identity"
  input: "layer_1/weights_and_biases/outwards_propagating_bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer_1/weights_and_biases/outwards_propagating_bias"
      }
    }
  }
}
node {
  name: "layer_1/placeholders/input_placeholder"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 1
        }
      }
    }
  }
}
node {
  name: "layer_1/placeholders/last_hidden"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 25
        }
      }
    }
  }
}
node {
  name: "layer_1/placeholders/last_cell"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 25
        }
      }
    }
  }
}
node {
  name: "layer_1/to_gates/input_concat/axis"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "layer_1/to_gates/input_concat"
  op: "ConcatV2"
  input: "layer_1/placeholders/input_placeholder"
  input: "layer_1/placeholders/last_hidden"
  input: "layer_1/to_gates/input_concat/axis"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "layer_1/to_gates/f_w_m"
  op: "MatMul"
  input: "layer_1/to_gates/input_concat"
  input: "layer_1/weights_and_biases/forget_weight/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "layer_1/to_gates/f_b_a"
  op: "Add"
  input: "layer_1/to_gates/f_w_m"
  input: "layer_1/weights_and_biases/forget_bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "layer_1/to_gates/o_w_m"
  op: "MatMul"
  input: "layer_1/to_gates/input_concat"
  input: "layer_1/weights_and_biases/output_weight/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "layer_1/to_gates/o_b_a"
  op: "Add"
  input: "layer_1/to_gates/o_w_m"
  input: "layer_1/weights_and_biases/output_bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "layer_1/to_gates/g_w_m"
  op: "MatMul"
  input: "layer_1/to_gates/input_concat"
  input: "layer_1/weights_and_biases/gate_weight/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "layer_1/to_gates/g_b_a"
  op: "Add"
  input: "layer_1/to_gates/g_w_m"
  input: "layer_1/weights_and_biases/gate_bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "layer_1/to_gates/i_w_m"
  op: "MatMul"
  input: "layer_1/to_gates/input_concat"
  input: "layer_1/weights_and_biases/input_weight/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "layer_1/to_gates/i_b_a"
  op: "Add"
  input: "layer_1/to_gates/i_w_m"
  input: "layer_1/weights_and_biases/input_bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "layer_1/non-linearity/sigmoid_forget"
  op: "Sigmoid"
  input: "layer_1/to_gates/f_b_a"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "layer_1/non-linearity/sigmoid_output"
  op: "Sigmoid"
  input: "layer_1/to_gates/o_b_a"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "layer_1/non-linearity/sigmoid_input"
  op: "Sigmoid"
  input: "layer_1/to_gates/i_b_a"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "layer_1/non-linearity/tanh_gate"
  op: "Tanh"
  input: "layer_1/to_gates/g_b_a"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "layer_1/forget_gate/forget_gating"
  op: "Mul"
  input: "layer_1/non-linearity/sigmoid_forget"
  input: "layer_1/placeholders/last_cell"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "layer_1/suggestion_node/input_determiner"
  op: "Mul"
  input: "layer_1/non-linearity/sigmoid_input"
  input: "layer_1/non-linearity/tanh_gate"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "layer_1/suggestion_node/input_and_gate_gating"
  op: "Add"
  input: "layer_1/suggestion_node/input_determiner"
  input: "layer_1/forget_gate/forget_gating"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "layer_1/output_gate/output_presquashing"
  op: "Tanh"
  input: "layer_1/suggestion_node/input_and_gate_gating"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "layer_1/output_gate/next_hidden"
  op: "Mul"
  input: "layer_1/non-linearity/sigmoid_output"
  input: "layer_1/output_gate/output_presquashing"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "layer_1/output_gate/WHTO_w_m"
  op: "MatMul"
  input: "layer_1/output_gate/next_hidden"
  input: "layer_1/weights_and_biases/outwards_propagating_weight/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "layer_1/output_gate/BHTO_b_a"
  op: "Add"
  input: "layer_1/output_gate/WHTO_w_m"
  input: "layer_1/weights_and_biases/outwards_propagating_bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "layer_1/output_gate/output"
  op: "Relu"
  input: "layer_1/output_gate/BHTO_b_a"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "layer_1/summaries_and_saver/W_Forget/tag"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "layer_1/summaries_and_saver/W_Forget"
      }
    }
  }
}
node {
  name: "layer_1/summaries_and_saver/W_Forget"
  op: "HistogramSummary"
  input: "layer_1/summaries_and_saver/W_Forget/tag"
  input: "layer_1/weights_and_biases/forget_weight/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "layer_1/summaries_and_saver/W_Input/tag"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "layer_1/summaries_and_saver/W_Input"
      }
    }
  }
}
node {
  name: "layer_1/summaries_and_saver/W_Input"
  op: "HistogramSummary"
  input: "layer_1/summaries_and_saver/W_Input/tag"
  input: "layer_1/weights_and_biases/input_weight/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "layer_1/summaries_and_saver/W_Output/tag"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "layer_1/summaries_and_saver/W_Output"
      }
    }
  }
}
node {
  name: "layer_1/summaries_and_saver/W_Output"
  op: "HistogramSummary"
  input: "layer_1/summaries_and_saver/W_Output/tag"
  input: "layer_1/weights_and_biases/output_weight/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "layer_1/summaries_and_saver/W_Gate/tag"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "layer_1/summaries_and_saver/W_Gate"
      }
    }
  }
}
node {
  name: "layer_1/summaries_and_saver/W_Gate"
  op: "HistogramSummary"
  input: "layer_1/summaries_and_saver/W_Gate/tag"
  input: "layer_1/weights_and_biases/gate_weight/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "layer_1/summaries_and_saver/W_Hidden_to_Out/tag"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "layer_1/summaries_and_saver/W_Hidden_to_Out"
      }
    }
  }
}
node {
  name: "layer_1/summaries_and_saver/W_Hidden_to_Out"
  op: "HistogramSummary"
  input: "layer_1/summaries_and_saver/W_Hidden_to_Out/tag"
  input: "layer_1/weights_and_biases/outwards_propagating_weight/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "layer_1/summaries_and_saver/Cell_State/tag"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "layer_1/summaries_and_saver/Cell_State"
      }
    }
  }
}
node {
  name: "layer_1/summaries_and_saver/Cell_State"
  op: "HistogramSummary"
  input: "layer_1/summaries_and_saver/Cell_State/tag"
  input: "layer_1/output_gate/output_presquashing"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "layer_1/summaries_and_saver/B_Forget/tag"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "layer_1/summaries_and_saver/B_Forget"
      }
    }
  }
}
node {
  name: "layer_1/summaries_and_saver/B_Forget"
  op: "HistogramSummary"
  input: "layer_1/summaries_and_saver/B_Forget/tag"
  input: "layer_1/weights_and_biases/forget_bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "layer_1/summaries_and_saver/B_Input/tag"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "layer_1/summaries_and_saver/B_Input"
      }
    }
  }
}
node {
  name: "layer_1/summaries_and_saver/B_Input"
  op: "HistogramSummary"
  input: "layer_1/summaries_and_saver/B_Input/tag"
  input: "layer_1/weights_and_biases/input_bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "layer_1/summaries_and_saver/B_Output/tag"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "layer_1/summaries_and_saver/B_Output"
      }
    }
  }
}
node {
  name: "layer_1/summaries_and_saver/B_Output"
  op: "HistogramSummary"
  input: "layer_1/summaries_and_saver/B_Output/tag"
  input: "layer_1/weights_and_biases/output_bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "layer_1/summaries_and_saver/B_Gate/tag"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "layer_1/summaries_and_saver/B_Gate"
      }
    }
  }
}
node {
  name: "layer_1/summaries_and_saver/B_Gate"
  op: "HistogramSummary"
  input: "layer_1/summaries_and_saver/B_Gate/tag"
  input: "layer_1/weights_and_biases/gate_bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "layer_1/summaries_and_saver/B_Hidden_to_Out/tag"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "layer_1/summaries_and_saver/B_Hidden_to_Out"
      }
    }
  }
}
node {
  name: "layer_1/summaries_and_saver/B_Hidden_to_Out"
  op: "HistogramSummary"
  input: "layer_1/summaries_and_saver/B_Hidden_to_Out/tag"
  input: "layer_1/weights_and_biases/outwards_propagating_bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "layer_2/weights_and_biases/random_normal/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\032\000\000\000\031\000\000\000"
      }
    }
  }
}
node {
  name: "layer_2/weights_and_biases/random_normal/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "layer_2/weights_and_biases/random_normal/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "layer_2/weights_and_biases/random_normal/RandomStandardNormal"
  op: "RandomStandardNormal"
  input: "layer_2/weights_and_biases/random_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "layer_2/weights_and_biases/random_normal/mul"
  op: "Mul"
  input: "layer_2/weights_and_biases/random_normal/RandomStandardNormal"
  input: "layer_2/weights_and_biases/random_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "layer_2/weights_and_biases/random_normal"
  op: "Add"
  input: "layer_2/weights_and_biases/random_normal/mul"
  input: "layer_2/weights_and_biases/random_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "layer_2/weights_and_biases/forget_weight"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 26
        }
        dim {
          size: 25
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "layer_2/weights_and_biases/forget_weight/Assign"
  op: "Assign"
  input: "layer_2/weights_and_biases/forget_weight"
  input: "layer_2/weights_and_biases/random_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer_2/weights_and_biases/forget_weight"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "layer_2/weights_and_biases/forget_weight/read"
  op: "Identity"
  input: "layer_2/weights_and_biases/forget_weight"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer_2/weights_and_biases/forget_weight"
      }
    }
  }
}
node {
  name: "layer_2/weights_and_biases/random_normal_1/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\032\000\000\000\031\000\000\000"
      }
    }
  }
}
node {
  name: "layer_2/weights_and_biases/random_normal_1/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "layer_2/weights_and_biases/random_normal_1/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "layer_2/weights_and_biases/random_normal_1/RandomStandardNormal"
  op: "RandomStandardNormal"
  input: "layer_2/weights_and_biases/random_normal_1/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "layer_2/weights_and_biases/random_normal_1/mul"
  op: "Mul"
  input: "layer_2/weights_and_biases/random_normal_1/RandomStandardNormal"
  input: "layer_2/weights_and_biases/random_normal_1/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "layer_2/weights_and_biases/random_normal_1"
  op: "Add"
  input: "layer_2/weights_and_biases/random_normal_1/mul"
  input: "layer_2/weights_and_biases/random_normal_1/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "layer_2/weights_and_biases/output_weight"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 26
        }
        dim {
          size: 25
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "layer_2/weights_and_biases/output_weight/Assign"
  op: "Assign"
  input: "layer_2/weights_and_biases/output_weight"
  input: "layer_2/weights_and_biases/random_normal_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer_2/weights_and_biases/output_weight"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "layer_2/weights_and_biases/output_weight/read"
  op: "Identity"
  input: "layer_2/weights_and_biases/output_weight"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer_2/weights_and_biases/output_weight"
      }
    }
  }
}
node {
  name: "layer_2/weights_and_biases/random_normal_2/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\032\000\000\000\031\000\000\000"
      }
    }
  }
}
node {
  name: "layer_2/weights_and_biases/random_normal_2/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "layer_2/weights_and_biases/random_normal_2/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "layer_2/weights_and_biases/random_normal_2/RandomStandardNormal"
  op: "RandomStandardNormal"
  input: "layer_2/weights_and_biases/random_normal_2/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "layer_2/weights_and_biases/random_normal_2/mul"
  op: "Mul"
  input: "layer_2/weights_and_biases/random_normal_2/RandomStandardNormal"
  input: "layer_2/weights_and_biases/random_normal_2/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "layer_2/weights_and_biases/random_normal_2"
  op: "Add"
  input: "layer_2/weights_and_biases/random_normal_2/mul"
  input: "layer_2/weights_and_biases/random_normal_2/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "layer_2/weights_and_biases/gate_weight"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 26
        }
        dim {
          size: 25
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "layer_2/weights_and_biases/gate_weight/Assign"
  op: "Assign"
  input: "layer_2/weights_and_biases/gate_weight"
  input: "layer_2/weights_and_biases/random_normal_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer_2/weights_and_biases/gate_weight"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "layer_2/weights_and_biases/gate_weight/read"
  op: "Identity"
  input: "layer_2/weights_and_biases/gate_weight"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer_2/weights_and_biases/gate_weight"
      }
    }
  }
}
node {
  name: "layer_2/weights_and_biases/random_normal_3/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\032\000\000\000\031\000\000\000"
      }
    }
  }
}
node {
  name: "layer_2/weights_and_biases/random_normal_3/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "layer_2/weights_and_biases/random_normal_3/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "layer_2/weights_and_biases/random_normal_3/RandomStandardNormal"
  op: "RandomStandardNormal"
  input: "layer_2/weights_and_biases/random_normal_3/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "layer_2/weights_and_biases/random_normal_3/mul"
  op: "Mul"
  input: "layer_2/weights_and_biases/random_normal_3/RandomStandardNormal"
  input: "layer_2/weights_and_biases/random_normal_3/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "layer_2/weights_and_biases/random_normal_3"
  op: "Add"
  input: "layer_2/weights_and_biases/random_normal_3/mul"
  input: "layer_2/weights_and_biases/random_normal_3/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "layer_2/weights_and_biases/input_weight"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 26
        }
        dim {
          size: 25
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "layer_2/weights_and_biases/input_weight/Assign"
  op: "Assign"
  input: "layer_2/weights_and_biases/input_weight"
  input: "layer_2/weights_and_biases/random_normal_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer_2/weights_and_biases/input_weight"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
